app/controllers/laboratories_controller.rb

SELECT "laboratories".* FROM "laboratories"
---
  def index
    @laboratories = Laboratory.all