app/models/user.rb

SELECT  "roles".* FROM "roles" WHERE "roles"."name" = ? LIMIT ?  [["name", "administrador"], ["LIMIT", 1]]
SELECT  "roles".* FROM "roles" WHERE "roles"."name" = ? LIMIT ?  [["name", "cliente"], ["LIMIT", 1]]
---
    def verify_role
      self.role = Role.find_by(name: "administrador") if admin?
      self.role = Role.find_by(name: "cliente") if client?