app/views/layouts/_sidebar.html.erb

SELECT  "roles".* FROM "roles" WHERE "roles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "menu_actions".* FROM "menu_actions" WHERE "menu_actions"."role_id" = ?  [["role_id", 1]]
---
  <ul class="nav flex-column">
    <% current_user.role.menu_actions.each do |menu_action| %>